app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = Account.all

INSERT INTO "accounts" ("account_name", "account_number", "created_at", "sru", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_name", "Försäljning"], ["account_number", 3000], ["created_at", Fri, 11 Apr 2014 15:23:29 UTC +00:00], ["sru", 7410], ["updated_at", Fri, 11 Apr 2014 15:23:29 UTC +00:00]]
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "account_number" = $1, "updated_at" = $2 WHERE "accounts"."id" = 1  [["account_number", 30101], ["updated_at", Fri, 11 Apr 2014 22:30:34 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_account
      @account = Account.find(params[:id])