app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 200], ["id", "157"]]
---
  def show
    @company = current_user.companies.find(params[:id])

INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 15 Apr 2014 21:51:47 UTC +00:00], ["name", "Exceed IT AB"], ["updated_at", Tue, 15 Apr 2014 21:51:47 UTC +00:00]]
---
  def create
    @company = Company.new(company_params)
    @company.users = [current_user]

    respond_to do |format|
      if @company.save

SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 176], ["id", "128"]]
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = 90  [["name", "a46"], ["updated_at", Wed, 16 Apr 2014 17:21:29 UTC +00:00]]
---
  def update
    @company = current_user.companies.find(params[:id])
    respond_to do |format|
      if @company.update(company_params)

SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 243], ["id", "213"]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 234]]
---
  def destroy
    @company = current_user.companies.find(params[:id])
    @company.destroy