app/controllers/fiscal_years_controller.rb

  def index
    @fiscal_years = current_user.companies.find(params[:company_id]).fiscal_years.all
---
SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 726], ["id", "1501"]]
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."company_id" = $1  [["company_id", 1501]]

  def show
    @fiscal_year = current_user.companies.find(params[:company_id]).fiscal_years.find(params[:id])
---
SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 771], ["id", "1575"]]
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."company_id" = $1 AND "fiscal_years"."id" = $2 LIMIT 1  [["company_id", 1604], ["id", "165"]]

  def edit
    @fiscal_year = current_user.companies.find(params[:company_id]).fiscal_years.find(params[:id])
---
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @fiscal_year = FiscalYear.new(fiscal_year_params)
    @fiscal_year.company = current_user.companies.find(params[:company_id])

    respond_to do |format|
      if @fiscal_year.save
---
SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 815], ["id", "1653"]]
INSERT INTO "fiscal_years" ("company_id_id", "created_at", "end_date", "start_date", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["company_id_id", 1], ["created_at", Tue, 15 Apr 2014 21:52:11 UTC +00:00], ["end_date", Mon, 31 Mar 2014], ["start_date", Tue, 01 Jan 2013], ["updated_at", Tue, 15 Apr 2014 21:52:11 UTC +00:00]]

  def update
    @fiscal_year = current_user.companies.find(params[:company_id]).fiscal_years.find(params[:id])
    respond_to do |format|
      if @fiscal_year.update(fiscal_year_params)
---
SELECT "companies".* FROM "companies" INNER JOIN "companies_users" ON "companies"."id" = "companies_users"."company_id" WHERE "companies_users"."user_id" = $1 AND "companies"."id" = $2 LIMIT 1  [["user_id", 896], ["id", "1794"]]
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."company_id" = $1 AND "fiscal_years"."id" = $2 LIMIT 1  [["company_id", 1797], ["id", "261"]]
UPDATE "fiscal_years" SET "company_id" = $1, "updated_at" = $2 WHERE "fiscal_years"."id" = 1  [["company_id", 2], ["updated_at", Tue, 15 Apr 2014 22:19:12 UTC +00:00]]

  def destroy
    @fiscal_year.destroy
---
DELETE FROM "fiscal_years" WHERE "fiscal_years"."id" = $1  [["id", 128]]

    def set_fiscal_year
      @fiscal_year = FiscalYear.find(params[:id])
---
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."id" = $1 LIMIT 1  [["id", "128"]]