app/controllers/vouchers_controller.rb

  def index
    sleep(1)
    @vouchers = current_user.companies.find(params[:company_id]).fiscal_years.find(params[:fiscal_year_id]).vouchers
---
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @voucher = Voucher.new(voucher_params)
    @voucher.fiscal_year = current_user.companies.find(params[:company_id]).fiscal_years.find(params[:fiscal_year_id])

    respond_to do |format|
      if @voucher.save
---
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "vouchers" ("created_at", "date", "fiscal_year_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 15 Apr 2014 21:56:02 UTC +00:00], ["date", Tue, 15 Apr 2014], ["fiscal_year_id", 1], ["title", ""], ["updated_at", Tue, 15 Apr 2014 21:56:02 UTC +00:00]]

  def update
    respond_to do |format|
      if @voucher.update(voucher_params)
---
UPDATE "vouchers" SET "title" = $1, "updated_at" = $2 WHERE "vouchers"."id" = 1  [["title", "Försäljning"], ["updated_at", Tue, 15 Apr 2014 21:56:46 UTC +00:00]]

  def set_voucher
    @voucher = current_user.companies.find(params[:company_id]).fiscal_years.find(params[:fiscal_year_id]).vouchers.find(params[:id])
---
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "vouchers".* FROM "vouchers" WHERE "vouchers"."id" = $1 LIMIT 1  [["id", "1"]]