app/controllers/vouchers_controller.rb

SELECT "vouchers".* FROM "vouchers"
---
  def index
    @vouchers = Voucher.all